** 1. Pandas is a python module that makes data science easy & effective.

In [1]:
import pandas as pd

Different ways of creating Dataframes:

1. Using CSV File.
2. Using Excel File.
3. Using Python Dictionaries
4. Using list of tuples.
5. Using list of dictionaries.

In [66]:
df = pd.read_csv("C:\\Users\\app\\Desktop\\data.csv")

In [67]:
print(df)

  sample_data  Column1  Column2  Column3  Column4
0     header1  header2  header3  header4  header5
1         abc     25.5       87      843     abcd
2         xyz       30      700      500     xyzw
3         lmn       60       20      600      cvd
4         pqr       50      300       10      lop
5         rst       23     2536       20      poi

In [13]:
df1 = pd.read_excel("C:\\Users\\app\\Desktop\\data1.xlsx")

In [14]:
print(df1)

  header1  header2  header3  header4 header5
0     abc     25.5       87      843    abcd
1     xyz     30.0      700      500    xyzw
2     lmn     60.0       20      600     cvd
3     pqr     50.0      300       10     lop
4     rst     23.0     2536       20     poi

In [21]:
weather_data = {'Day':['1/1/2018', '1/2/2018', '1/3/2018', '1/4/2018'],
                'Temperature': [32, 35, 28, 24],
                'WindSpeed': [6, 7, 2, 7], 
                'Event': ['Rain', 'Sunny', 'Snow', 'Snow']
               }

df2 = pd.DataFrame(weather_data)
print(df2)

        Day  Event  Temperature  WindSpeed
0  1/1/2018   Rain           32          6
1  1/2/2018  Sunny           35          7
2  1/3/2018   Snow           28          2
3  1/4/2018   Snow           24          7

In [24]:
weather_data1 = [['1/1/2018', 32, 6, 'Rain'],
                 ['1/2/2018', 35, 7, 'Sunny'],
                 ['1/3/2018', 28, 2, 'Snow'],
                 ['1/4/2018', 24, 7, 'Snow'],
                ]

df2 = pd.DataFrame(weather_data1, columns = ['Day', 'Temperature', 'WindSpeed', 'Event'])
df2

        Day  Temperature  WindSpeed  Event
0  1/1/2018           32          6   Rain
1  1/2/2018           35          7  Sunny
2  1/3/2018           28          2   Snow
3  1/4/2018           24          7   Snow

In [30]:
# 4th Method

weather_data2 = [ {'Day': '1/1/2018', 'Temperature': 32, 'WindSpeed': 6, 'Event': 'Rain'}, 
                  {'Day': '1/2/2018', 'Temperature': 35, 'WindSpeed': 7, 'Event': 'Sunny'},
                  {'Day': '1/3/2018', 'Temperature': 28, 'WindSpeed': 2, 'Event': 'Snow'},
                  {'Day': '1/4/2018', 'Temperature': 24, 'WindSpeed': 7, 'Event': 'Snow'}
                ]

df3 = pd.DataFrame(weather_data2) 
df3

        Day  Event  Temperature  WindSpeed
0  1/1/2018   Rain           32          6
1  1/2/2018  Sunny           35          7
2  1/3/2018   Snow           28          2
3  1/4/2018   Snow           24          7

In [31]:
df.shape

(5, 5)

In [32]:
df.head(4)

  header1  header2  header3  header4 header5
0     abc     25.5       87      843    abcd
1     xyz     30.0      700      500    xyzw
2     lmn     60.0       20      600     cvd
3     pqr     50.0      300       10     lop

In [33]:
df.tail(2)

  header1  header2  header3  header4 header5
3     pqr     50.0      300       10     lop
4     rst     23.0     2536       20     poi

In [34]:
df[1:3]

  header1  header2  header3  header4 header5
1     xyz     30.0      700      500    xyzw
2     lmn     60.0       20      600     cvd

In [35]:
df.columns

Index(['header1', 'header2', 'header3', 'header4', 'header5'], dtype='object')

In [37]:
df3.Day

0    1/1/2018
1    1/2/2018
2    1/3/2018
3    1/4/2018
Name: Day, dtype: object

In [38]:
type(df3['Day'])

pandas.core.series.Series

In [41]:
df3[['Event', 'Day']]

   Event       Day
0   Rain  1/1/2018
1  Sunny  1/2/2018
2   Snow  1/3/2018
3   Snow  1/4/2018

In [43]:
df3['Temperature'].max()

35

In [44]:
df3.describe()

       Temperature  WindSpeed
count     4.000000   4.000000
mean     29.750000   5.500000
std       4.787136   2.380476
min      24.000000   2.000000
25%      27.000000   5.000000
50%      30.000000   6.500000
75%      32.750000   7.000000
max      35.000000   7.000000

In [45]:
df3[df3.Temperature>=32]

        Day  Event  Temperature  WindSpeed
0  1/1/2018   Rain           32          6
1  1/2/2018  Sunny           35          7

In [46]:
df3.index

RangeIndex(start=0, stop=4, step=1)

In [64]:
new_df = df3.set_index(['Temperature'])
new_df

             level_0  index       Day  Event  WindSpeed
Temperature
32                 0      0  1/1/2018   Rain          6
35                 1      1  1/2/2018  Sunny          7
28                 2      2  1/3/2018   Snow          2
24                 3      3  1/4/2018   Snow          7

In [60]:
df3.index('Temperature', inplace = True)

TypeError: 'RangeIndex' object is not callable

In [65]:
new_df.reset_index(inplace = True)
new_df

   Temperature  level_0  index       Day  Event  WindSpeed
0           32        0      0  1/1/2018   Rain          6
1           35        1      1  1/2/2018  Sunny          7
2           28        2      2  1/3/2018   Snow          2
3           24        3      3  1/4/2018   Snow          7

In [71]:
df3.loc['Temperature']

KeyError: 'the label [Temperature] is not in the [index]'

In [69]:
df5 = pd.read_csv("C:\\Users\\app\\Desktop\\data.csv", header = 1)
df5

  header1  header2  header3  header4 header5
0     abc     25.5       87      843    abcd
1     xyz     30.0      700      500    xyzw
2     lmn     60.0       20      600     cvd
3     pqr     50.0      300       10     lop
4     rst     23.0     2536       20     poi

In [70]:
df6 = pd.read_csv("C:\\Users\\app\\Desktop\\data.csv", header = None)
df6

             0        1        2        3        4
0  sample_data  Column1  Column2  Column3  Column4
1      header1  header2  header3  header4  header5
2          abc     25.5       87      843     abcd
3          xyz       30      700      500     xyzw
4          lmn       60       20      600      cvd
5          pqr       50      300       10      lop
6          rst       23     2536       20      poi

In [72]:
df7 = pd.read_csv("C:\\Users\\app\\Desktop\\data.csv", header = None, names = ["header1", "hedaer2", "header3", "header4"])
df7

             header1  hedaer2  header3  header4
sample_data  Column1  Column2  Column3  Column4
header1      header2  header3  header4  header5
abc             25.5       87      843     abcd
xyz               30      700      500     xyzw
lmn               60       20      600      cvd
pqr               50      300       10      lop
rst               23     2536       20      poi

In [73]:
df8 = pd.read_csv("C:\\Users\\app\\Desktop\\data.csv", nrows = 2)
df8

  sample_data  Column1  Column2  Column3  Column4
0     header1  header2  header3  header4  header5
1         abc     25.5       87      843     abcd

In [81]:
df9 = pd.read_csv("C:\\Users\\app\\Desktop\\data.csv", na_values = ["not available", "NaN"])
df9

  sample_data  Column1  Column2  Column3  Column4
0     header1  header2  header3  header4  header5
1         abc     25.5       87      843     abcd
2         xyz      -30      700      500     xyzw
3         lmn       60       20      600      cvd
4         pqr       50      300       10      lop
5         rst       23     2536      NaN      NaN

In [94]:
df10 = pd.read_csv("C:\\Users\\app\\Desktop\\data.csv", na_values = ["Not Available", -1])
df10

  sample_data  Column1  Column2  Column3  Column4
0     header1  header2  header3  header4  header5
1         abc     25.5       87      843     abcd
2         xyz      NaN      700      500     xyzw
3         lmn       60       20      600      cvd
4         pqr       50      300       10      lop
5         rst       23     2536      NaN      NaN

In [90]:
df10.to_csv("new_data.csv")

In [93]:
# copying only specific columns

df10.to_csv("new_data1.csv", columns = ['sample_data', 'Column1'])

In [96]:
df10.to_csv("new_data2.csv", header = False)

In [97]:
df1

  header1  header2  header3  header4 header5
0     abc     25.5       87      843    abcd
1     xyz     30.0      700      500    xyzw
2     lmn     60.0       20      600     cvd
3     pqr     50.0      300       10     lop
4     rst     23.0     2536       20     poi

In [98]:
def convert_value(cell):
    if cell == "n.a.":
        return 'XYZ'
    return cell

In [106]:
df1 = pd.read_excel("C:\\Users\\app\\Desktop\\data1.xlsx", converters = convert_value(Column4))

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [102]:
df1

  sample_data  Column1  Column2  Column3  Column4
0     header1  header2  header3  header4  header5
1         abc     25.5       87      843     abcd
2         xyz       30      700      500     xyzw
3         lmn       60       20      600      cvd
4         pqr       50      300       10      lop
5         rst       23     2536     n.a.     n.a.

In [107]:
df1.to_excel("new_file.xlsx", sheet_name = "Data", startrow = 1, startcol = 2)

In [113]:
df11 = pd.read_excel("C:\\Users\\app\\Desktop\\data2.xlsx")
df11

  sample_data  Column1  Column2  Column3  Column4
0     header1  header2  header3  header4  header5
1         abc     25.5       87      843     abcd
2         xyz       30      700      500     xyzw
3         lmn       60       20      600      cvd
4         pqr       50      300       10      lop
5         rst       23     2536       30      lom

In [118]:
df3

   level_0  index       Day  Event  Temperature  WindSpeed
0        0      0  1/1/2018   Rain           32          6
1        1      1  1/2/2018  Sunny           35          7
2        2      2  1/3/2018   Snow           28          2
3        3      3  1/4/2018   Snow           24          7

In [120]:
with pd.ExcelWriter('combined_data2.xlsx') as writer:
    df1.to_excel(writer, sheet_name = "headers_data")
    df3.to_excel(writer, sheet_name = "Weather")

** Handle Missing Data

1. fillna
2. dropna
3. interpolate
4. replace

In [122]:
new_df1 = df1.fillna(0)
new_df1

  sample_data  Column1  Column2  Column3  Column4
0     header1  header2  header3  header4  header5
1         abc     25.5       87      843     abcd
2         xyz       30      700      500     xyzw
3         lmn       60       20      600      cvd
4         pqr       50      300       10      lop
5         rst       23     2536     n.a.     n.a.

In [ ]:
new_df = df.fillna({
    'Temperature': 0,
    'WindSpeed': 0,
    'Event': 'No Event'
})

In [ ]:
new_df = df.fillna(method = "ffill")
new_df = df.fillna(method = "bfill")


new_df = df.fillna(method = "bfill", axis = 'columns')
new_df = df.fillna(method = "bfill", limit = 2)

In [ ]:
new_df = df.interpolate()

new_df = df.interpolate(method = 'time')

In [ ]:
new_df = df.dropna()
new_df = df.dropna(how = "all")

new_df = df.dropna(thresh = 1)

In [ ]:
new_df = df.replace(-999999, np.NaN)
new_df = df.replace([-999999, 10555], np.NaN)